In [1]:
import pandas as pd
import numpy as np

In [4]:
rating = pd.read_csv('rating.csv')
cuisine = pd.read_csv('cuisine.csv')

In [5]:
rating.head()

  userID  placeID  rating  food_rating  service_rating
0  U1077   135085       2            2               2
1  U1077   135038       2            2               1
2  U1077   132825       2            2               2
3  U1077   135060       1            2               2
4  U1068   135104       1            1               2

In [6]:
cuisine.head()

   placeID        Rcuisine
0   135110         Spanish
1   135109         Italian
2   135107  Latin_American
3   135106         Mexican
4   135105       Fast_Food

In [42]:
rating_count = pd.DataFrame(rating.groupby('placeID')['rating'].count())
rating_count_ordered = rating_count.sort_values('rating', ascending=False)
rating_count_ordered.head(5)

         rating
placeID
135085       36
132825       32
135032       28
135052       25
132834       25

In [61]:
most_rated_places = pd.DataFrame(rating_count_ordered.index[0:6], index=np.arange(6), columns=['placeID'])
summary = pd.merge(most_rated_places, cuisine, on='placeID')
summary

   placeID         Rcuisine
0   135085        Fast_Food
1   132825          Mexican
2   135032        Cafeteria
3   135032     Contemporary
4   135052              Bar
5   135052  Bar_Pub_Brewery
6   132834          Mexican

# Some Testing this is not part of this Recommendation

In [72]:
rating_count_ordered.index[3:10]

Int64Index([135052, 132834, 135038, 135060, 135062, 135042, 132862], dtype='int64', name='placeID')

In [71]:
rating_count_ordered.loc[rating_count_ordered.index[3:10], ['rating']].index

Int64Index([135052, 132834, 135038, 135060, 135062, 135042, 132862], dtype='int64', name='placeID')

In [73]:
rating_count_ordered.loc[rating_count_ordered.index[3:10], ['rating']].values

array([[25],
       [25],
       [24],
       [22],
       [21],
       [20],
       [18]])

In [74]:
rating_count_ordered.loc[rating_count_ordered.index[3:10], ['rating']]

         rating
placeID
135052       25
132834       25
135038       24
135060       22
135062       21
135042       20
132862       18